Librerías y configuraciones

In [1]:
# Importamos las librerías que necesitamos
# 
# Tratamiento de datos
# -----------------------------------------------------------------------
import pandas as pd
import numpy as np

# Visualización
# ------------------------------------------------------------------------------
import matplotlib.pyplot as plt
import seaborn as sns


# Imputación de nulos usando métodos avanzados estadísticos
# -----------------------------------------------------------------------
from sklearn.impute import SimpleImputer
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer
from sklearn.impute import KNNImputer

# Evaluar linealidad de las relaciones entre las variables
# y la distribución de las variables
# ------------------------------------------------------------------------------
#import scipy.stats as stats
import scipy.stats as stats
from scipy.stats import shapiro, poisson, chisquare, expon, kstest

# Configuraciones
# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None)
pd.set_option('display.max_colwidth', None)

Abrimos archivos para hacer el EDA de ventas.

In [14]:
df_c = pd.read_csv('clientes.csv')
df_p = pd.read_csv('productos.csv')
df_v = pd.read_csv('ventas.csv')

In [6]:
df_c.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id_cliente  300 non-null    object
 1   nombre      300 non-null    object
 2   apellido    300 non-null    object
 3   ciudad      300 non-null    object
dtypes: object(4)
memory usage: 9.5+ KB

In [7]:
df_c.isnull().sum()

id_cliente    0
nombre        0
apellido      0
ciudad        0
dtype: int64

In [8]:
df_c.duplicated().sum()

0

In [11]:
df_c

    id_cliente  nombre   apellido            ciudad
0        C0001   Julia      López   Granada, España
1        C0002   Elena   Martínez   Granada, España
2        C0003   Laura    Sánchez     Lyon, Francia
3        C0004   Marta      López  Valencia, España
4        C0005     Ana   Martínez    París, Francia
..         ...     ...        ...               ...
295      C0296   Elena  Rodríguez   Sevilla, España
296      C0297   Marta  Rodríguez  Zaragoza, España
297      C0298   Julia      Pérez    Bilbao, España
298      C0299     Ana  Rodríguez   Sevilla, España
299      C0300  Carmen      Pérez  Aveiro, Portugal

[300 rows x 4 columns]

Separo Ciudad y País

In [15]:
# Separar ciudad y país
df_c[['ciudad', 'pais']] = df_c['ciudad'].str.split(', ', expand=True)

In [16]:
df_c

    id_cliente  nombre   apellido    ciudad      pais
0        C0001   Julia      López   Granada    España
1        C0002   Elena   Martínez   Granada    España
2        C0003   Laura    Sánchez      Lyon   Francia
3        C0004   Marta      López  Valencia    España
4        C0005     Ana   Martínez     París   Francia
..         ...     ...        ...       ...       ...
295      C0296   Elena  Rodríguez   Sevilla    España
296      C0297   Marta  Rodríguez  Zaragoza    España
297      C0298   Julia      Pérez    Bilbao    España
298      C0299     Ana  Rodríguez   Sevilla    España
299      C0300  Carmen      Pérez    Aveiro  Portugal

[300 rows x 5 columns]

Termino de analizar

In [17]:
df_c.describe().T

           count unique        top freq
id_cliente   300    300      C0001    1
nombre       300     10      María   42
apellido     300     10  Rodríguez   38
ciudad       300     20       Lyon   24
pais         300      3     España  146

In [18]:
df_c.describe(include='object').T

           count unique        top freq
id_cliente   300    300      C0001    1
nombre       300     10      María   42
apellido     300     10  Rodríguez   38
ciudad       300     20       Lyon   24
pais         300      3     España  146

Exporto el dataframe limpio de ventas a .csv

In [19]:
df_c.to_csv('clientes_limpio.csv')

In [20]:
for c in df_c.columns:
    display(c, df_c[c].value_counts)

'id_cliente'

<bound method IndexOpsMixin.value_counts of 0      C0001
1      C0002
2      C0003
3      C0004
4      C0005
       ...
295    C0296
296    C0297
297    C0298
298    C0299
299    C0300
Name: id_cliente, Length: 300, dtype: object>

'nombre'

<bound method IndexOpsMixin.value_counts of 0       Julia
1       Elena
2       Laura
3       Marta
4         Ana
        ...
295     Elena
296     Marta
297     Julia
298       Ana
299    Carmen
Name: nombre, Length: 300, dtype: object>

'apellido'

<bound method IndexOpsMixin.value_counts of 0          López
1       Martínez
2        Sánchez
3          López
4       Martínez
         ...
295    Rodríguez
296    Rodríguez
297        Pérez
298    Rodríguez
299        Pérez
Name: apellido, Length: 300, dtype: object>

'ciudad'

<bound method IndexOpsMixin.value_counts of 0       Granada
1       Granada
2          Lyon
3      Valencia
4         París
         ...
295     Sevilla
296    Zaragoza
297      Bilbao
298     Sevilla
299      Aveiro
Name: ciudad, Length: 300, dtype: object>

'pais'

<bound method IndexOpsMixin.value_counts of 0        España
1        España
2       Francia
3        España
4       Francia
         ...
295      España
296      España
297      España
298      España
299    Portugal
Name: pais, Length: 300, dtype: object>